using TrainingTasks2;

class Program
{
    static void Main(string[] args)
    { 
    
    }





//## 2. Игра “Битва с боссом”
//- Есть **игрок** и **босс**, у каждого — своё **HP**.
//- Игрок выбирает **тип атаки**, затем атакует.
//- После этого **босс наносит ответный удар**.
//- Раунд продолжается, пока один из участников не проиграет.
//- Можно добавить простые способности или разные типы атак.
//- Реализовать **меню выбора** и красиво оформить вывод.
//**Подсказка:**классы `Player`, `Boss`, `Battle`.